[
    {
        "netid": "aaallen",
        "name": "Abby Allen",
        "title": "Assistant Professor, Special Education",
        "text": "B.S., Speech and Hearing Science, University of Illinois Urbana-Champaign; Ph.D., Special Education, University of Missouri",
        "quote" : "My research centers on early writing assessment and intervention, curriculumbased measurement of written language, and data-based individualization across content areas. I recently received an Early Career Research and Mentoring Grant from the Institute of Educational Sciences and am developing a sentence writing intervention for elementary students with or at risk for learning disabilities."
    },
    {
        "netid": "jcbeard",
        "name": "Jackie Beard",
        "title": "Clinical Assistant Professor, Educational Psychology",
        "text": "B.S., Psychology, University of Illinois Urbana-Champaign; M.S.Ed. in Counseling and Counselor Education, Indiana University, Bloomington; Ph.D. in Counseling Psychology, University of Illinois Urbana-Champaign",
        "quote" : "After I completed my doctorate at Illinois, I served as interim director of Eastern Illinois University’s Counseling Center. Most recently, I spent the last 10 years working as a staff psychologist at the University of Illinois’ McKinley Health Center. My clinical interests include trauma, shame, LGBTQIA identity development, addictions, and graduate student concerns."
    },
    {
        "netid": "tbjones",
        "name": "Tamara Bertrand Jones",
        "title": "Professor, Education Policy, Organization & Leadership; Associate Dean for Faculty Affairs",
        "text": "B.S., Journalism, University of Texas at Austin; M.S., Higher Education, Florida State University; Ph.D., Research and Evaluation Methods, Florida State University",
        "quote" : "My nearly 25 years of work within higher education administration and as a program evaluator has also shaped my research on culturally responsive evaluation, higher education leadership, and faculty development. Before joining the College of Education at Illinois, I served as an associate professor of Higher Education, interim department chair, associate director of the Center for Postsecondary Success, and program coordinator for Higher Education at Florida State University."
    },
    {
        "netid": "jcami2",
        "name": "Joshua Camins",
        "title": "Clinical Assistant Professor, Educational Psychology",
        "text": "B.S., Criminal Justice and Psychology, University of New Haven; M.A., Clinical Psychology, Towson University; Ph.D., Clinical Psychology, Sam Houston State University",
        "quote" : "I am one of approximately 360 board-certified forensic psychologists in the nation and one of only 16 licensed in Illinois. Within the College of Education and affiliate units across campus, I will teach graduate courses in psychopathology and psychological assessment and provide clinical supervision for graduate students and offer assessment expertise as an affiliate of Disability Resources and Educational Services (DRES)."
    },
    {
        "netid": "feleciac",
        "name": "Felecia Commodore",
        "title": "Associate Professor, Education Policy, Organization & Leadership",
        "text": "B.S., Marketing, Drexel University (Philadelphia); M.A., Higher Education Administration from the University of Maryland; Ph.D., Higher Education, University of Pennsylvania",
        "quote" : "My research area is leadership, governance, and administrative practices, with a focus on Minority serving institutions and Historically Black Colleges & Universities. I’m interested in the role of boards in achieving educational equity, how leadership is exercised, constructed, and viewed in various communities, and the relationship between Black women and leadership. My expertise is at the intersection of organizational behavior, organizational decision-making, and organizational culture and how these areas impact achieving equity."
    },
    {
        "netid": "cuesta20",
        "name": "Carolina Cuesta-Hincapie",
        "title": "Teaching Assistant Professor, Education Policy, Organization & Leadership",
        "text": "M.S., Science, Technology, and Innovation Management, Universidad de Antioquia (Colombia); M.S.Ed., Learning Design and Technology and Ph.D., Curriculum and Instruction, Purdue University",
        "quote" : "My research explores the intersection between creativity and instructional design and how to design learning environments that foster creative thinking. I am also interested in creative self-efficacy and how to develop an entrepreneurial mindset. I taught Entrepreneurship and Innovation for seven years in Colombia, incorporating creativity related pedagogical approaches to support student learning and help develop creativity. Additionally, I am working on developing intercultural creative thinking as an inclusive pedagogical approach."
    },
    {
        "netid": "kristend",
        "name": "Kristen Driscoll",
        "title": "Assistant Professor, Curriculum & Instruction",
        "text": "B.A., Early Childhood Education and M.Ed., Teaching and Learning with a Specialization in Literacy, Coastal Carolina University; Ph.D., Curriculum & Instruction – Literacy Studies, University of Colorado Boulder",
        "quote" : "My research resides at the intersection of theory and practice in my collaboration with educators, children, and their families as I examine the ways educational policy at federal and state levels influences early literacy instruction and assessment in elementary schools and in teacher education. My work informs how I support preservice teachers in developing equity-minded stances, racial literacy, and ways to advocate for children who are historically underserved in public schools, particularly when mandated literacy curriculum and assessment does not always leverage students’ literacies, languages, and cultural practices."
    },
    {
        "netid": "filkins",
        "name": "Scott Filkins",
        "title": "Lecturer, Program Coordinator, Curriculum & Instruction",
        "text": "B.A. English, Ed.M. and Ed.D. Curriculum & Instruction, University of Illinois Urbana-Champaign.",
        "quote" : "I previously worked as a high school English teacher in the Champaign School District for 23 years and as a content specialist on the ReadWriteThink project at the National Council of Teachers of English for two years. My teaching and research focus on the roles of reading, writing, and talk in learning as shaped by the academic disciplines in school settings. I’m interested in how we can build and support students’ language repertoires for more flexible, agentive participation."
    },
    {
        "netid": "gayithri",
        "name": "Gayithri Jayathirtha",
        "title": "Assistant Professor, Curriculum & Instruction",
        "text": "B.E., Computer Science Engineering, Bangalore University (India); M.S.Ed., Learning Sciences and Technologies and Ph.D., Learning Sciences, University of Pennsylvania",
        "quote" : "I was a K-12 math teacher and teacher workshop facilitator in Bangalore, India, for six years before starting my graduate studies in the U.S. I started my postdoctoral career as a Computing Innovation Fellow at the University of Oregon, where I worked with high school computing teachers to think about and redesign a justice-oriented computing program."
    },
    {
        "netid": "john0025",
        "name": "Jennifer Johnson",
        "title": "Assistant Professor, Education Policy, Organization and Leadership",
        "text": "B.A., Elementary Education and Ed.M. in Curriculum & Instruction, Arizona State University; Ph.D., Educational Studies, University of Oklahoma",
        "quote" : "My research interests include the history of education in Indigenous communities, Indigenous language revitalization and Indigenous knowledge systems. I am a citizen of the Seminole Nation and a descendant of the Sac and Fox Nation, and prior to my graduate work was an elementary school teacher on Tribal reservations in Arizona and Florida. I was also a cofounder of Pumvhakv Immersion School, a language learning school for early childhood through college students within the Seminole Nation."
    },
    {
        "netid": "lixu",
        "name": "Xu Li",
        "title": "Associate Professor, Educational Psychology",
        "text": "B.S., Mathematical Sciences and Ed.M., Clinical and Counseling Psychology, Beijing Normal University (China); Ph.D., Counseling Psychology, at the University of Maryland",
        "quote" : "I previously was on faculty at the University of Wisconsin Milwaukee’s School of Education and am a licensed psychologist in the state of Wisconsin. My research focuses on the process, outcome, and training in individual and group psychotherapy from multicultural and cross-cultural contexts. I am interested in using advanced quantitative or statistical methods in psychotherapy research."
    },
    {
        "netid": "lmagee",
        "name": "Liam Magee",
        "title": "Professor, Education Policy, Organization and Leadership",
        "text": "B.A. in English and Philosophy, University of Melbourne; Ph.D., Global Studies, Social Sciences and Planning; Royal Melbourne Institute of Technology (Australia)",
        "quote" : "Before arriving at the University of Illinois Urbana-Champaign, I was principal research fellow at the Institute for Culture and Society at Western Sydney University. Encompassing digital, media and urban studies, my scholarly work examines how technology affects how we experience education, culture, and social life. My current research investigates many of the profound changes, negative as well as positive, effected by generative AI. These include the impacts of algorithmic bias, misinformation and plagiarism, alongside new possibilities for equitable learning and innovative research."
    },
    {
        "netid": "mlmorg",
        "name": "Melissa Morgan",
        "title": "Professor, Educational Psychology",
        "text": "B.A., Psychology, Southwestern University; M.A., Clinical Psychology, Stephen F. Austin State University; Ph.D., Counseling Psychology, Loyola University (Chicago)",
        "quote" : "For the past two years I was professor and associate department chair in the Department of Clinical Psychology at Adler University of Chicago. My research interests lie in the areas of resilience, thriving, social justice and immigration in Latinx populations. I teach courses on multicultural issues, theories, gender issues in counseling, ethnic and racial issues in counseling, prevention, CBPR, and qualitative methods."
    },
    {
        "netid": "tmoton2",
        "name": "Theopolies Moton III",
        "title": "Teaching Assistant Professor, Education Policy, Organization and Leadership",
        "text": "B.A and M.A., American History, Southern University and A&M College (Louisiana); Ph.D., Education Policy Studies, University of Illinois Urbana Champaign",
        "quote" : "I use critical historical research methods to examine the reciprocal relationship between current federal and state educational policies and the lack of equitable higher ed opportunities for students and minority serving institutions. With research, teaching, and service commitments to advancing racial justice, cultural understanding, and culturally responsible policies and practices in higher education, my areas of interest include the history of U.S. education, the history of African American education, the history of U.S. higher education, and education law."
    },
    {
        "netid": "velazqu1",
        "name": "MIRELSIE VELÁZQUEZ",
        "title": "Associate Professor, Education Policy, Organization and Leadership",
        "text": "B.A., Political Science and Latina/o Studies, M.A. and Ph.D., Educational Policy Studies, University of Illinois Urbana-Champaign",
        "quote" : "I am an interdisciplinary scholar and my work centers history of education, women’s history, Puerto Rican studies, gender and sexuality, and teacher education. I consider myself a historian of education because of my own relationship to schools and schooling, especially as it relates to my identity and community. I am currently working on a book project that historicizes Puerto Rican women and other Latina activists in higher education across the Midwest, from the 1970s to the 1990s, as they worked to create homespaces."
    },
    {
        "netid": "xrzhu",
        "name": "Xinran Zhu",
        "title": "Assistant Professor, Education Policy, Organization and Leadership",
        "text": "M.A.; Educational Psychology, University of Connecticut; Ph.D., Learning Sciences and Technologies, University of Pennsylvania",
        "quote" : "My research interests lie at the intersection of learning sciences, learning analytics, and human-computer interaction. Grounded in research-practice partnerships, I develop pedagogical designs, technological innovations, and empirical understandings of learning in authentic settings. My recent work involves designing web applications to scaffold computer-supported collaborative learning, conducting computational research to derive actionable insights for educational practice, and investigating the potential of AI tools in augmenting human knowledge creation."
    }
]